#+title: Journal
#+author: Preston Pan
#+description: My journal entries
#+html_head: <link rel="stylesheet" type="text/css" href="../style.css" />
#+date: <2023-06-09 Fri>
#+language: en
#+OPTIONS: broken-links:t
#+html_head: <link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
#+html_head: <link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
#+html_head: <link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
#+html_head: <link rel="manifest" href="/site.webmanifest">
#+html_head: <link rel="mask-icon" href="/safari-pinned-tab.svg" color="#5bbad5">
#+html_head: <meta name="msapplication-TileColor" content="#da532c">
#+html_head: <meta name="theme-color" content="#ffffff">
#+html_head: <meta name="viewport" content="width=1000; user-scalable=0;" />
* Introduction
This is my journal. It's basically my everyday life from
a technology perspective (not many personal details although
there will be some). I will also be posting some TODOs that I have
throughout time.

** Entries
@@html: <div class="links-page">@@
If you're interested, here is a list of all my journal entries:
#+begin_src shell :results output raw :exports both
#printf "@@html: <div class=\"links\">@@\n"
for f in $(ls | sort -r);
do
    if [[ "$f" == "index.org" || "$f" == "README.org" ]]; then
        continue
    fi
    printf -- "- [[file:$f][$f]]\n"
done
#printf "@@html: </div>@@\n"
#+end_src

#+RESULTS:
- [[file:20240524.org][20240524.org]]
- [[file:20240519.org][20240519.org]]
- [[file:20240512.org][20240512.org]]
- [[file:20240510.org][20240510.org]]
- [[file:20240503.org][20240503.org]]
- [[file:20240502.org][20240502.org]]
- [[file:20240416.org][20240416.org]]
- [[file:20240404.org][20240404.org]]
- [[file:20240330.org][20240330.org]]
- [[file:20240329.org][20240329.org]]
- [[file:20240324.org][20240324.org]]
- [[file:20240323.org][20240323.org]]
- [[file:20240321.org][20240321.org]]
- [[file:20240319.org][20240319.org]]
- [[file:20240318.org][20240318.org]]
- [[file:20240317.org][20240317.org]]
- [[file:20240316.org][20240316.org]]
- [[file:20240315.org][20240315.org]]
- [[file:20240314.org][20240314.org]]
- [[file:20240313.org][20240313.org]]
- [[file:20240312.org][20240312.org]]
- [[file:20240311.org][20240311.org]]
- [[file:20240310.org][20240310.org]]
- [[file:20240309.org][20240309.org]]
- [[file:20240306.org][20240306.org]]
- [[file:20240301.org][20240301.org]]
- [[file:20240229.org][20240229.org]]
- [[file:20240228.org][20240228.org]]
- [[file:20240226.org][20240226.org]]
- [[file:20240210.org][20240210.org]]
- [[file:20240205.org][20240205.org]]
- [[file:20240128.org][20240128.org]]
- [[file:20240127.org][20240127.org]]
- [[file:20240126.org][20240126.org]]
- [[file:20240125.org][20240125.org]]
- [[file:20240124.org][20240124.org]]
- [[file:20240123.org][20240123.org]]
- [[file:20240110.org][20240110.org]]
- [[file:20231220.org][20231220.org]]
- [[file:20231217.org][20231217.org]]
- [[file:20231215.org][20231215.org]]
- [[file:20231214.org][20231214.org]]
- [[file:20231213.org][20231213.org]]
- [[file:20231210.org][20231210.org]]
- [[file:20231209.org][20231209.org]]
- [[file:20231208.org][20231208.org]]
- [[file:20230711.org][20230711.org]]
- [[file:20230704.org][20230704.org]]
- [[file:20230625.org][20230625.org]]
- [[file:20230624.org][20230624.org]]
- [[file:20230623.org][20230623.org]]
- [[file:20230622.org][20230622.org]]
- [[file:20230621.org][20230621.org]]
- [[file:20230620.org][20230620.org]]
- [[file:20230619.org][20230619.org]]
- [[file:20230616.org][20230616.org]]
- [[file:20230615.org][20230615.org]]
- [[file:20230614.org][20230614.org]]
- [[file:20230613.org][20230613.org]]
- [[file:20230611.org][20230611.org]]
- [[file:20230610.org][20230610.org]]
- [[file:20230609.org][20230609.org]]
@@html: </div>@@
